Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute.ProfileName Property
 The name of the profile (often empty).
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ProfileName { get; set; }
Public Property ProfileName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ReferenceModelObjectAttribute Class
Tekla.Structures.Model.Collaboration Namespace